[{"storyId": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
"storyLabel" : "Zayn al-Din Ibn Naja",
"firstStage": "intro",
"story": [
    {"stageId": "intro",
    "stageLabel": "Introducing Ibn Naja",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>Ibn Naja was one of Saladin's most trusted companions. Click the arrows below to follow his story</p>",
    "links": [],
    "prevStage": "",
    "nextStage": "earlyLife"},
    {"stageId": "earlyLife",
    "stageLabel": "His early life",
    "focusNode": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج",
    "storyHtml": "<p><a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> was the grandson of <a name='AbuFaraj'>Ahmad al-Shirazi Abi al-Faraj</a> who was considered one of the greatest Hanbali scholars of his age and who moved from Baghdad to Palestine then Damascus where he taught. He played a seminal role in the spread of the Hanbali school in Syria. Ibn Rajab considered him to be the greatest Hanbali scholar in Syria. <a name='IbnAsakir1'>Ibn Asakir</a> notes that al-Shirazi spread the Hanbali madhhab in Jerusalem and Damascus</p>.<p><a name ='SharafIslam'>Sharaf al-Islam Abd al-Wahab</a> was the son of <a name='AbuFaraj'>Abu Faraj</a> and the uncle of <a name='IbnNaja'>Ibn Naja</a>.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "AbuFaraj",
        "type": "node",
        "link": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج"},
        {"id": "IbnAsakir1",
        "type:" : "webLink",
        "link": "http://dev.kitab-project.org/lite-reader/0571IbnCasakir.TarikhDimashq.JK000916-ara1/"},
        {"id": "SharafIslam",
        "type": "node",
        "link": "شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي"}],
    "prevStage": "intro",
    "nextStage": "jilaniLinks"},
    {"stageId": "jilaniLinks",
    "stageLabel": "His links to Jilani",
    "focusNode": "عبد القادر الجيلاني",
    "storyHtml": "<p> شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي was the teacher of عثمان بن مرزوق بن حميد بن سلام القرشي who studied under him in Damascus. عثمان بن مرزوق بن حميد بن سلام القرشي became a disciple of عبد القادر الجيلاني. It is said (reported in ibn Rajab) that he accompanied Jilani on the pilgrimage to Mecca where he became his disciple and read hadith with him. It is also said that أبو مدين شعيب بن الحسين الأنصاري was present with the two men.  According to Vincent Cornell, Abu Madyan never travelled East to perform the pilgrimage,  nor is there any mention in the tabaqat works relating to al-Jilani. One also takes into account how frequently accounts of saintly figures in medieval Islam have been subjected to embellishments and apocryphal ascriptions.</p> <p>And yet al-Jilani’s son, Abdel-Raziq does say, ‘when my father, May Allah have Mercy upon him, went on pilgrimage in the year in which I was with him during it, he met with two Shaykhs, Ibn Marzuq and Abu Madyan. The two wore cloaks from him (ie they became disciples).’  سعد بن عثمان بن مرزوق بن حميد بن سلام القرشي the son of عثمان بن مرزوق بن حميد بن سلام القرشي left Cairo for Baghdad where he remained for the rest of his life. Buried in the ribat of عبد القادر الجيلاني. Funeral prayers were held for him in the madrasa of Abd al-Qadir (Al-Qadisi). However, when it came for him to be buried, the mother of the Caliph sent her servants to take the body and had it interred in a tomb near her tomb place.</p>",
    "links": [],
    "prevStage": "earlyLife",
    "nextStage": "ibnQudamaDamascus"
},
{"stageId": "ibnQudamaDamascus",
    "stageLabel": "Ibn Qudama in Damascus",
    "focusNode": "احمد ابن محمد ابن قدامة",
    "storyHtml": "<p> احمد ابن محمد ابن قدامة studied under عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج. It was Abu’ Faraj who introduced Hanabli school to Qudamas. The massacre at al-Aqsa, as well as other massacres, sparked waves of flight of residents from Jerusalem, amongst whom were many scholars and jurists. In the village of Jama ‘il, 16 kilometres south west of Nablus,  the Hanbali احمد ابن محمد ابن قدامة rallied the farmers and peasants to sabotage and boycott the Crusaders. His fiery sermons attracted many who flocked to Jama’ ‘il on Fridays where they also attended lessons in Quran recitation and listened to hadith.  Anger was reaching boiling point as stretches of their agricultural lands was given to the new settlers.  News of the sermons ofاحمد ابن محمد ابن قدامة, reached the Franks, ‘this faqih prevented the peasants from working the land and they gathered around him. So, they, and in particular Balian of ‘Ibilin (known as Balian ibn Barisan), the Crusader ruler of Nablus spoke about having him killed.’  When Ahmed heard of this, he escaped to Damascus. In 1156 Ahmad was the first of the Qudama family to arrive in Damascus, a city with close trading and scholarly links to Nablus. As soon as Ahmed arrived, he sent for his son, موفق الدين ابن قدامة عبد الله بن أحمد بن محمد بن أحمد بن قدامة بن مقدم بن نصwho brought the rest of the family,  The Qudama family inspired others to relocate to Damascus. These immigrants became known as Maqdisis (Jerusalemites). However, tensions arose between Ahmad and the local Hanbalis arose. News of the quarrel reached نور الدين محمود زنكي who was sitting with his chief judge عبد الله ابن ابي عصرون, a follower of the Shafi’i madhhab. When Nur al-Din asked him for his advice, he commended the Qudama immigrants, remarking that many of them knew the Qur’an by heart.</p>",
    "links": [],
    "prevStage": "jilaniLinks",
    "nextStage": "jilaniDisciples"},
    {"stageId": "jilaniDisciples",
    "stageLabel": "Jilani and his followers in Baghdad",
    "focusNode": "عبد القادر الجيلاني",
    "storyHtml": "<p>عبد الله ابن ابي عصرون travelled to Baghdad where he studied under عبد القادر الجيلاني</p> <p> موفق الدين ابن قدامة عبد الله بن أحمد بن محمد بن أحمد بن قدامة بن مقدم بن نصر was the cousin of عبد الغني المقدسي. The two travelled to Baghdad where they met and became disciples of عبد القادر الجيلاني. </p> <p> أبو المجد عيسى موفق الدين ابن قدامة was the son of موفق الدين ابن قدامة عبد الله بن أحمد بن محمد بن أحمد بن قدامة بن مقدم بن نصر. He studied under فَاطِمَةُ بِنْتُ أَبِي الحَسَنِ سَعْدُ الخَيْرِ who was the wife of زين الدين أبو الحسن علي بن إبراهيم بن نجا and the daughter of سعد الْخَيْر بن مُحَمَّد بن سهل بن سعد أَبُي الْحسن الْأنْصَارِيّ under whom زين الدين أبو الحسن علي بن إبراهيم بن نجا studied. </p> <p>زين الدين أبو الحسن علي بن إبراهيم بن نجا travelled to Baghdad where he studied under several teachers and became a student and disciple of عبد القادر الجيلاني.</p><p>It was عبد القادر الجيلاني who instructed زين الدين أبو الحسن علي بن إبراهيم بن نجا to travel to Fatimid Egypt. But first he was told to head to Damascus with a message for نور الدين محمود زنكي. </p>",
    "links": [],
    "prevStage": "ibnQudamaDamascus",
    "nextStage": "najaDamascus"},
    {"stageId": "najaDamascus",
    "stageLabel": "Ibn Naja goes to Damascus",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>عبد القادر الجيلاني told زين الدين أبو الحسن علي بن إبراهيم بن نجا, <em>'You will reach Damascus and you will find there an army ready to invade Egypt. Say: you will not conquer it on this occasion. Is it not better for you to turn back so that you conquer it on another?'</em> In Damascus زين الدين أبو الحسن علي بن إبراهيم بن نجا related the message and was instructed by نور الدين محمود زنكي not to mention it to anyone. زين الدين أبو الحسن علي بن إبراهيم بن نجا also met أسد الدين شيركوه before heading to Egypt.</p>",
    "links": [],
    "prevStage": "jilaniDisciples",
    "nextStage": "earlyEgypt"},
    {"stageId": "earlyEgypt",
    "stageLabel": "Ibn Naja's arrival in Egypt",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>In Egypt, زين الدين أبو الحسن علي بن إبراهيم بن نجا met with عثمان بن مرزوق بن حميد بن سلام القرشي who taught at the Amr ibn al-As mosque and was a sufi shaykh with may followers. There is little doubt that this introduction had been facilitated by عبد القادر الجيلاني for he had met with عثمان بن مرزوق بن حميد بن سلام القرشي during the pilgrimage where the Egyptian Shaykh had become a disciple. عثمان بن مرزوق بن حميد بن سلام القرشي asked زين الدين أبو الحسن علي بن إبراهيم بن نجا about his journey to Damascus and then told him, أسد الدين شيركوه will come to this land [Egypt] and will go and will not gain anything, he will then return and depart and he will not gain this land. Then he will return and will take it and he will rule Egypt.’ Puzzled by those enigmatic utterances, he asked عثمان بن مرزوق بن حميد بن سلام القرشي, ‘Ya Sidi, from where do you get this knowledge?’ He replied, ‘My son, I do not know the Unseen but on occasion the Prophet comes to me and tells me.’</p><p>What is clear is that those in Baghdad and Damascus were preoccupied with affairs in Egypt and were plotting for the fall of the Fatimids and the restoration of Sunnism to the land of the Nile. Intriguingly both al-Jilani and Ibn Marzuq forewarned Ibn Naja that Shirkuh’s initial campaign would not succeed, and though this certainly can be read as examples of spiritual visions of the Shaykhs, it could also be read as astute political assessments that the Fatimid rule was not weak enough to fall.</p>",
    "links": [],
    "prevStage": "najaDamascus",
    "nextStage": "egyptFatimids"},
    {"stageId": "egyptFatimids",
    "stageLabel": "Ibn Naja and the declining Fatimid dynasty",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>Intriguingly, while he was busy plotting with the Sunni elements in Egypt to undermine the Fatimids and passing messages back to Damascus, زين الدين أبو الحسن علي بن إبراهيم بن نجا was also making successful inroads among the Fatimid authorities. He managed to meet and gain the confidence of the Caliph العاضد لدين الله أبو محمد عبد الله بن يوسف بن الحافظ لدين الله. He also met and won the favour of the vizier طلائع ﺑﻦ ﺭﺯﻳﻚ who gave him 20,000 dinars and a house to live in.</p><p>While in Egypt زين الدين أبو الحسن علي بن إبراهيم بن نجا came to know القاضي الفاضل as well as other important dignitaries. He also managed to infiltrate the circles of the poet عمارة اليمني and reported back to Saladin that there was a plot against his life.</p>",
    "links": [],
    "prevStage": "earlyEgypt",
    "nextStage": "saladin"},
    {"stageId": "saladin",
    "stageLabel": "Ibn Naja and Saladin",
    "focusNode": "صلاح الدين",
    "storyHtml": "<p>It was in Egypt that زين الدين أبو الحسن علي بن إبراهيم بن نجا came to know صلاح الدين’s family, including his father, نجم الدين أيوب , his brothers, توران شاه بن أيوب‎ and الملك العادل سيف الدين أبو بكر بن أيوب‎. He also knew Saladin's sons, ، الملك العزيز عماد الدين أبو الفتح عثمان بن صلاح الدين الملك الظاهر غياث الدين غازي بن الناصر صلاح الدين, أبو الحسن علي بن صلاح الدين الملك الأفضل, He also knew Saladin’s nephew الملك المظفر تقي الدين عمر بن الأمير نور الدولة شاهنشاه</p>",
    "links": [],
    "prevStage": "",
    "nextStage": ""}
    ]}]