[{"storyId": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
"storyLabel" : "Zayn al-Din Ibn Naja",
"firstStage": "intro",
"story": [
    {"stageId": "intro",
    "stageLabel": "Introducing Ibn Naja",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>Ibn Naja was one of Saladin's most trusted companions. Click the arrows below to follow his story</p>",
    "links": [],
    "prevStage": "",
    "nextStage": "earlyLife"},
    {"stageId": "earlyLife",
    "stageLabel": "His early life",
    "focusNode": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج",
    "storyHtml": "<p><a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> was the grandson of <a name='AbuFaraj'>Ahmad al-Shirazi Abi al-Faraj</a> who was considered one of the greatest Hanbali scholars of his age and who moved from Baghdad to Palestine then Damascus where he taught. He played a seminal role in the spread of the Hanbali school in Syria. Ibn Rajab considered him to be the greatest Hanbali scholar in Syria. <a name='IbnAsakir1'>Ibn Asakir</a> notes that al-Shirazi spread the Hanbali madhhab in Jerusalem and Damascus.</p><p><a name ='SharafIslam'>Sharaf al-Islam Abd al-Wahab</a> was the son of <a name='AbuFaraj'>Abu Faraj</a> and the uncle of <a name='IbnNaja'>Ibn Naja</a>.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "AbuFaraj",
        "type": "node",
        "link": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج"},
        {"id": "IbnAsakir1",
        "type:" : "webLink",
        "link": "http://dev.kitab-project.org/lite-reader/0571IbnCasakir.TarikhDimashq.JK000916-ara1/"},
        {"id": "SharafIslam",
        "type": "node",
        "link": "شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي"}],
    "prevStage": "intro",
    "nextStage": "jilaniLinks"},
    {"stageId": "jilaniLinks",
    "stageLabel": "His links to Jilani",
    "focusNode": "عبد القادر الجيلاني",
    "storyHtml": "<p><a name='SharafIslam'>Sharaf al-Islam</a> was the teacher of <a name='qurshi'>Uthman b. Marzuq</a> who studied under him in Damascus. <a name='qurshi'>Uthman b. Marzuq</a> became a disciple of <a name='jilani'>Abd al-Qadir al-Jilani</a>. It is said (reported in ibn Rajab) that he accompanied Jilani on the pilgrimage to Mecca where he became his disciple and read hadith with him. It is also said that <a name='ansari'>Abi Madyan al-Ansari</a> was present with the two men.  According to Vincent Cornell, Abu Madyan never travelled East to perform the pilgrimage, nor is there any mention in the tabaqat works relating to al-Jilani. One also takes into account how frequently accounts of saintly figures in medieval Islam have been subjected to embellishments and apocryphal ascriptions.</p> <p>And yet al-Jilani’s son, Abdel-Raziq does say, <em>‘when my father, May Allah have Mercy upon him, went on pilgrimage in the year in which I was with him during it, he met with two Shaykhs, Ibn Marzuq and Abu Madyan. The two wore cloaks from him (ie they became disciples).’</em> <a name='sadBinUthman'>Sa'd b. Uthman</a> the son of <a name='qurshi'>Uthman b. Marzuq</a> left Cairo for Baghdad where he remained for the rest of his life. Buried in the ribat of <a name='jilani'>al-Jilani</a>. Funeral prayers were held for him in the madrasa of Abd al-Qadir (Al-Qadisi). However, when it came for him to be buried, the mother of the Caliph sent her servants to take the body and had it interred in a tomb near her tomb place.</p>",
    "links": [
        {"id": "SharafIslam",
        "type": "node",
        "link": "شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي"},
        {"id": "qurshi",
        "type": "node",
        "link": "عثمان بن مرزوق بن حميد بن سلام القرشي"},
        {"id": "jilani",
        "type": "node",
        "link": "عبد القادر الجيلاني"},
        {"id": "ansari",
        "type": "node",
        "link": "أبو مدين شعيب بن الحسين الأنصاري"},
        {"id": "sadBinUthman",
        "type": "node",
        "link": "سعد بن عثمان بن مرزوق بن حميد بن سلام القرشي"}],
    "prevStage": "earlyLife",
    "nextStage": "ibnQudamaDamascus"
},
{"stageId": "ibnQudamaDamascus",
    "stageLabel": "Ibn Qudama in Damascus",
    "focusNode": "احمد ابن محمد ابن قدامة",
    "storyHtml": "<p><a name = 'ibnQudama'> Ahmad ibn Muhammad ibn Qudama </a> studied under<a name='AbuFaraj'>Abu Faraj</a>. It was Abu Faraj who introduced the Hanabli school to Qudamas. The massacre at al-Aqsa, as well as other massacres, sparked waves of flight of residents from Jerusalem, amongst whom were many scholars and jurists. In the village of Jama‘il, 16 kilometres south west of Nablus,  the Hanbali <a name='ibnQudama'>Ibn Qudama</a> rallied the farmers and peasants to sabotage and boycott the Crusaders. His fiery sermons attracted many who flocked to Jama‘il on Fridays where they also attended lessons in Quran recitation and listened to hadith.  Anger was reaching boiling point as stretches of their agricultural lands was given to the new settlers.  News of the sermons of <a name='ibnQudama'>Ibn Qudama</a>, reached the Franks, <em>‘this faqih prevented the peasants from working the land and they gathered around him. So, they, and in particular Balian of ‘Ibilin (known as Balian ibn Barisan), the Crusader ruler of Nablus spoke about having him killed.’</em>  When Ahmed heard of this, he escaped to Damascus. In 1156 Ahmad was the first of the Qudama family to arrive in Damascus, a city with close trading and scholarly links to Nablus. As soon as Ahmed arrived, he sent for his son, <a name='muwaffaqDin'>Muwaffaq al-Din Ibn Qudama</a> who brought the rest of the family. The Qudama family inspired others to relocate to Damascus. These immigrants became known as Maqdisis (Jerusalemites). However, tensions between <a name='ibnQudama'>Ahmad</a> and the local Hanbalis arose. News of the quarrel reached <a name='nurDinZengi'>Nur al-Din Zengi</a> who was sitting with his chief judge <a name='abiAsrun'>Abdullah Ibn Abi 'Asrun</a>, a follower of the Shafi’i madhhab. When Nur al-Din asked him for his advice, he commended the Qudama immigrants, remarking that many of them knew the Qur’an by heart.</p>",
    "links": [
        {"id": "ibnQudama",
        "type": "node",
        "link": "احمد ابن محمد ابن قدامة"},
        {"id": "AbuFaraj",
        "type": "node",
        "link": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج"},
        {"id": "muwaffaqDin",
        "type": "node",
        "link": "موفق الدين ابن قدامة ،عبد الله بن أحمد بن محمد بن أحمد بن قدامة بن مقدم بن نصر"},
        {"id": "nurDinZengi",
        "type": "node",
        "link": "نور الدين محمود زنكي"},
        {"id": "abiAsrun",
        "type": "node",
        "link": "عبد الله ابن ابي عصرون"}],
    "prevStage": "jilaniLinks",
    "nextStage": "jilaniDisciples"},
    {"stageId": "jilaniDisciples",
    "stageLabel": "Jilani and his followers in Baghdad",
    "focusNode": "عبد القادر الجيلاني",
    "storyHtml": "<p><a name='abiAsrun'>Abdullah Ibn Abi 'Asrun</a> travelled to Baghdad where he studied under <a name='jilani'>Abd al-Qadir al-Jilani</a></p> <p><a name='muwaffaqDin'>Muwaffaq al-Din Ibn Qudama</a> was the cousin of <a name='abdGhani'>Abd al-Ghani al-Maqdisi</a>. The two travelled to Baghdad where they met and became disciples of <a name='jilani'>al-Jilani</a>.</p> <p><a name='abuMajd'> Abu Majd 'Aisa Muwaffaq al-Din Ibn Qudama</a> was the son of <a name='muwaffaqDin'>Muwaffaq al-Din Ibn Qudama</a>. He studied under <a name='fatima'>Fatima bt. al-Hasan Sa'd al-Khayr</a> who was the wife of <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> and the daughter of <a name='sadKhayr'>Sa'd al-Khayr al-Ansari</a> under whom <a name = 'IbnNaja'>Ibn Naja</a> studied. </p> <p><a name = 'IbnNaja'>Ibn Naja</a> travelled to Baghdad where he studied under several teachers and became a student and disciple of <a name='jilani'>Abd al-Qadir al-Jilani</a>.</p><p>It was <a name='jilani'>al-Jilani</a> who instructed <a name = 'IbnNaja'>Ibn Naja</a> to travel to Fatimid Egypt. But first he was told to head to Damascus with a message for <a name='nurDinZengi'>Nur al-Din Zengi</a>.</p>",
    "links": [
        {"id": "abiAsrun",
        "type": "node",
        "link": "عبد الله ابن ابي عصرون"},
        {"id": "jilani",
        "type": "node",
        "link": "عبد القادر الجيلاني"},
        {"id": "muwaffaqDin",
        "type": "node",
        "link": "موفق الدين ابن قدامة ،عبد الله بن أحمد بن محمد بن أحمد بن قدامة بن مقدم بن نصر"},
        {"id": "abdGhani",
        "type": "node",
        "link": "عبد الغني المقدسي"},
        {"id": "abuMajd",
        "type": "node",
        "link": "أبو المجد عيسى موفق الدين ابن قدامة"},
        {"id": "fatima",
        "type": "node",
        "link": "فَاطِمَةُ بِنْتُ أَبِي الحَسَنِ سَعْدُ الخَيْرِ"},
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "sadKhayr",
        "type": "node",
        "link": "سعد الْخَيْر بن مُحَمَّد بن سهل بن سعد أَبُي الْحسن الْأنْصَارِيّ"},
        {"id": "nurDinZengi",
        "type": "node",
        "link": "نور الدين محمود زنكي"}],
    "prevStage": "ibnQudamaDamascus",
    "nextStage": "najaDamascus"},
    {"stageId": "najaDamascus",
    "stageLabel": "Ibn Naja goes to Damascus",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p><a name='jilani'>Abd al-Qadir al-Jilani</a> told <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a>, <em>'You will reach Damascus and you will find there an army ready to invade Egypt. Say: you will not conquer it on this occasion. Is it not better for you to turn back so that you conquer it on another?'</em> In Damascus <a name = 'IbnNaja'>Ibn Naja</a> related the message and was instructed by <a name='nurDinZengi'>Nur al-Din Zengi</a> not to mention it to anyone.<a name = 'IbnNaja'>Ibn Naja</a> also met <a name='shirkuh'>Asad al-Din Shirkuh</a> before heading to Egypt.</p>",
    "links": [
        {"id": "jilani",
        "type": "node",
        "link": "عبد القادر الجيلاني"},
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "nurDinZengi",
        "type": "node",
        "link": "نور الدين محمود زنكي"},
        {"id": "shirkuh",
        "type": "node",
        "link": "أسد الدين شيركوه"}],
    "prevStage": "jilaniDisciples",
    "nextStage": "earlyEgypt"},
    {"stageId": "earlyEgypt",
    "stageLabel": "Ibn Naja's arrival in Egypt",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>In Egypt, <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> met with <a name='qurshi'>Uthman b. Marzuq</a> who taught at the Amr ibn al-As mosque and was a sufi shaykh with may followers. There is little doubt that this introduction had been facilitated by <a name='jilani'>Abd al-Qadir al-Jilani</a> for he had met with <a name='qurshi'>Uthman b. Marzuq</a> during the pilgrimage where the Egyptian Shaykh had become a disciple. <a name='qurshi'>Uthman b. Marzuq</a> asked <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> about his journey to Damascus and then told him, <em>‘<a name='shirkuh'>Asad al-Din Shirkuh</a> will come to this land [Egypt] and will go and will not gain anything, he will then return and depart and he will not gain this land. Then he will return and will take it and he will rule Egypt.’</em> Puzzled by those enigmatic utterances, he asked <a name='qurshi'>Uthman b. Marzuq</a>, <em>‘Ya Sidi, from where do you get this knowledge?’</em> He replied, <em>‘My son, I do not know the Unseen but on occasion the Prophet comes to me and tells me.’</em></p><p>What is clear is that those in Baghdad and Damascus were preoccupied with affairs in Egypt and were plotting for the fall of the Fatimids and the restoration of Sunnism to the land of the Nile. Intriguingly both al-Jilani and Ibn Marzuq forewarned Ibn Naja that Shirkuh’s initial campaign would not succeed, and though this certainly can be read as examples of spiritual visions of the Shaykhs, it could also be read as astute political assessments that the Fatimid rule was not weak enough to fall.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "qurshi",
        "type": "node",
        "link": "عثمان بن مرزوق بن حميد بن سلام القرشي"},
        {"id": "jilani",
        "type": "node",
        "link": "عبد القادر الجيلاني"},
        {"id": "shirkuh",
        "type": "node",
        "link": "أسد الدين شيركوه"}
    ],
    "prevStage": "najaDamascus",
    "nextStage": "egyptFatimids"},
    {"stageId": "egyptFatimids",
    "stageLabel": "Ibn Naja and the declining Fatimid dynasty",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>Intriguingly, while he was busy plotting with the Sunni elements in Egypt to undermine the Fatimids and passing messages back to Damascus, <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> was also making successful inroads among the Fatimid authorities. He managed to meet and gain the confidence of the Caliph <a name='adidDin'>'Adid li-din Allah</a>. He also met and won the favour of the vizier <a name='ibnRuzzik'>Tala'i b. Ruzzik</a> who gave him 20,000 dinars and a house to live in.</p><p>While in Egypt <a name = 'IbnNaja'>Ibn Naja</a> came to know <a name='qadiFadil'>al-Qadi al-Fadil</a> as well as other important dignitaries. He also managed to infiltrate the circles of the poet <a name='umaraYamani'>'Umara al-Yamani</a> and reported back to Saladin that there was a plot against his life.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "adidDin",
        "type": "node",
        "link": "العاضد لدين الله أبو محمد عبد الله بن يوسف بن الحافظ لدين الله"},
        {"id": "ibnRuzzik",
        "type": "node",
        "link": "طلائع ﺑﻦ ﺭﺯﻳﻚ"},
        {"id": "qadiFadil",
        "type": "node",
        "link": "القاضي الفاضل"},
        {"id": "umaraYamani",
        "type": "node",
        "link": "عمارة اليمني"}
    ],
    "prevStage": "earlyEgypt",
    "nextStage": "saladin"},
    {"stageId": "saladin",
    "stageLabel": "Ibn Naja and Saladin",
    "focusNode": "صلاح الدين",
    "storyHtml": "<p>It was in Egypt that <a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> came to know <a name='saladin'>Saladin's</a> family, including his father, <a name='najmDinAyyub'>Najm al-Din Ayyub</a>, his brothers, <a name='turanShah'>Turan Shah</a> and <a name='malikAdil'>al-Malik al-Adil</a>. He also knew Saladin's sons, <a name='malikAziz'>al-Malik al-Aziz 'Imad al-Din</a>, <a name='malikZahir'>al-Malik al-Zahir Ghayath al-Din</a>, and <a name='abuHassanAli'>Abu al-Hassan Ali</a>. He also knew Saladin’s nephew <a name='malikMuzaffar'>al-Malik al-Muzaffar</a>.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "saladin",
        "type": "node",
        "link": "صلاح الدين"},
        {"id": "najmDinAyyub",
        "type": "node",
        "link": "نجم الدين أيوب"},
        {"id": "turanShah",
        "type": "node",
        "link": "توران شاه بن أيوب‎"},
        {"id": "malikAdil",
        "type": "node",
        "link": "الملك العادل سيف الدين أبو بكر بن أيوب‎"},
        {"id": "malikAziz",
        "type": "node",
        "link": "الملك العزيز عماد الدين أبو الفتح عثمان بن صلاح الدين"},
        {"id": "malikZahir",
        "type": "node",
        "link": "الملك الظاهر غياث الدين غازي بن الناصر صلاح الدين"},
        {"id": "abuHassanAli",
        "type": "node",
        "link": "أبو الحسن علي بن صلاح الدين الملك الأفضل"},
        {"id": "malikMuzaffar",
        "type": "node",
        "link": "الملك المظفر تقي الدين عمر بن الأمير نور الدولة شاهنشاه"}],
    "prevStage": "egyptFatimids",
    "nextStage": ""}
    ]}]