[{"storyId": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
"storyLabel" : "Zayn al-Din Ibn Naja",
"firstStage": "intro",
"story": [
    {"stageId": "intro",
    "stageLabel": "Introducing Ibn Naja",
    "focusNode": "زين الدين أبو الحسن علي بن إبراهيم بن نجا",
    "storyHtml": "<p>Ibn Naja was one of Saladin's most trusted companions. Click the arrows below to follow his story</p>",
    "links": [],
    "prevStage": "",
    "nextStage": "earlyLife"},
    {"stageId": "earlyLife",
    "stageLabel": "His early life",
    "focusNode": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج",
    "storyHtml": "<p><a name = 'IbnNaja'>Zayn al-Din Ibn Naja</a> was the grandson of <a name='AbuFaraj'>Ahmad al-Shirazi Abi al-Faraj</a> who was considered one of the greatest Hanbali scholars of his age and who moved from Baghdad to Palestine then Damascus where he taught. He played a seminal role in the spread of the Hanbali school in Syria. Ibn Rajab considered him to be the greatest Hanbali scholar in Syria. <a name='IbnAsakir1'>Ibn Asakir</a> notes that al-Shirazi spread the Hanbali madhhab in Jerusalem and Damascus</p>.<p><a name ='SharafIslam'>Sharaf al-Islam Abd al-Wahab</a> was the son of <a name='AbuFaraj'>Abu Faraj</a> and the uncle of <a name='IbnNaja'>Ibn Naja</a>.</p>",
    "links": [
        {"id": "IbnNaja",
        "type": "node",
        "link": "زين الدين أبو الحسن علي بن إبراهيم بن نجا"},
        {"id": "AbuFaraj",
        "type": "node",
        "link": "عبد الْوَاحِد بن مُحَمَّد بن عَليّ بن أَحْمد الشِّيرَازِيّ أبي الفرج"},
        {"id": "IbnAsakir1",
        "type:" : "webLink",
        "link": "http://dev.kitab-project.org/lite-reader/0571IbnCasakir.TarikhDimashq.JK000916-ara1/"},
        {"id": "SharafIslam",
        "type": "node",
        "link": "شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي"}],
    "prevStage": "intro",
    "nextStage": "jilaniLinks"},
    {"stageId": "jilaniLinks",
    "stageLabel": "His links to Jilani",
    "focusNode": "عبد القادر الجيلاني",
    "storyHtml": "<p> شرف الإسلام عبد الوهاب بن أبي الفرج الحنبلي was the teacher of عثمان بن مرزوق بن حميد بن سلام القرشي who studied under him in Damascus. عثمان بن مرزوق بن حميد بن سلام القرشي became a disciple of عبد القادر الجيلاني. It is said (reported in ibn Rajab) that he accompanied Jilani on the pilgrimage to Mecca where he became his disciple and read hadith with him. It is also said that أبو مدين شعيب بن الحسين الأنصاري was present with the two men.  According to Vincent Cornell, Abu Madyan never travelled East to perform the pilgrimage,  nor is there any mention in the tabaqat works relating to al-Jilani. One also takes into account how frequently accounts of saintly figures in medieval Islam have been subjected to embellishments and apocryphal ascriptions.</p> <p>And yet al-Jilani’s son, Abdel-Raziq does say, ‘when my father, May Allah have Mercy upon him, went on pilgrimage in the year in which I was with him during it, he met with two Shaykhs, Ibn Marzuq and Abu Madyan. The two wore cloaks from him (ie they became disciples).’  سعد بن عثمان بن مرزوق بن حميد بن سلام القرشي the son of عثمان بن مرزوق بن حميد بن سلام القرشي left Cairo for Baghdad where he remained for the rest of his life. Buried in the ribat of عبد القادر الجيلاني. Funeral prayers were held for him in the madrasa of Abd al-Qadir (Al-Qadisi). However, when it came for him to be buried, the mother of the Caliph sent her servants to take the body and had it interred in a tomb near her tomb place.</p>",
    "links": [],
    "prevStage": "earlyLife",
    "nextStage": "ibnQudamaDamascus"
},
{"stageId": "ibnQudamaDamascus",
    "stageLabel": "Ibn Qudama in Damascus",
    "focusNode": "",
    "storyHtml": "",
    "links": [],
    "prevStage": "",
    "nextStage": ""},
    {"stageId": "",
    "stageLabel": "",
    "focusNode": "",
    "storyHtml": "",
    "links": [],
    "prevStage": "",
    "nextStage": ""}
    ]}]